<template>
  <div>
    <Service-Section :item="item" :index="index" v-for="(item,index) in serviceItems"></Service-Section>
  </div>
</template>

<script>
    import ServiceSection from './Service/Section.vue'
    export default {
        data () {
            return {
                serviceItems: [
                    {
                        title: 'Web制作',
                        subTitle: '企画から構築まで',
                        balloons: [
                          'ザインから運用まで制作を依頼したい',
                          'まずは見積もりだけでも相談したいデ',
                          'スマートフォン対応がしたい。',
                          '集客を増やしたい'
                        ],
                        heading: 'デザインからシステム構築、Web制作のあらゆるニーズに柔軟に対応',
                        texts: [
                            '企画提案から運用まで、いちからサイト制作をトータルサポートします。',
                            'お客様のニーズに合わせ、最新の製作技術を武器に、丁寧な制作提案を低コストで実現します。',
                            'Webをメインに制作を行うchatboxだからこそ、効果的なWebページのデザイン提案に自信があります。',
                            'また、システム開発や印刷物デザインにも応用可能な対応力で柔軟に対応。',
                        ],
                        number: 'num01',
                        thumbnail: '/images/serviceHeading_create.jpg',
                        id: 'web',
                        examples: [
                            'イベントサイト制作',
                            'CMS構築',
                            'アプリケーションデザイン',
                            '名刺・チラシ制作',
                        ]
                    },
                    {
                        title: 'システム開発',
                        subTitle: '業務管理システムやBtoC向けシステムの開発',
                        balloons: [
                            '社内の業務フローを改善したい',
                            'Webシステムの保守、改修で対応出来ない',
                            '複雑な要件定義がわからない',
                            'システム開発を行いたい'
                        ],
                        heading: '業務フローの改善から、複雑な要件定義のサポートまで、制作フローの問題を解決',
                        texts: [
                            '「業務管理システム」では、現状の業務フローをしっかりお伺いし、運用シーンに沿ったWebシステムを丁寧に作り上げ、納品後の運用までしっかりサポートします。',
                            '「Webシステム」では、会員管理や販売管理などWebを通じた顧客取引に関するシステム制作も数多く手がけています。',
                            '全ての人にとって使いやすいような、デザイン・画面設計はもちろん、開発だけでなく運用まで見据えた保守設計で、日々発生する改善ニーズにも迅速に対応できます。',
                            '多くの経験とノウハウで客様にベストなシステム開発を提供します。',
                        ],
                        number: 'num02',
                        thumbnail: '/images/serviceHeading_system.jpg',
                        id: 'system',
                        examples: [
                            '勤怠管理システム',
                            '製造業向け在庫管理システム',
                            '電子カルテ',
                            'ECサイト',
                        ]
                    },
                    {
                        title: '技術顧問',
                        subTitle: '現場の業務対応から最新技術まで',
                        balloons: [
                            '案件のすすめ方を相談したい',
                            '社内勉強会を開催したい',
                            '繁忙期の持ち帰り対応',
                            '現場の技術の相談'
                        ],
                        heading: '複雑化するシステム構築の課題を、最新の制作技術でしっかりサポート',
                        texts: [
                            'IT技術は常に進化を続けていきます。',
                            'チームや組織が常に新しい取り組みに挑戦できるようにするためには、深い知見をもったアドバイザーの存在が欠かせません。',
                            'chatboxの技術顧問サービスは、お客様の制作現場のアドバイザーとして日々発生する様々な制作上の疑問・課題に取り組んでいきます。',
                            'コミュニティやセミナー運営で培った技術力で、制作現場の技術的課題を効率的にサポートしております。'
                        ],
                        number: 'num03',
                        thumbnail: '/images/serviceHeading_support.jpg',
                        id: 'advise',
                        examples: [
                            '見積・工数相談',
                            '制作技術サポート',
                            '現場のニーズに即した社員研修',
                            '運用代行',
                        ]
                    },
                    {
                        title: 'イベント',
                        subTitle: 'Web業界全体の技術力向上を目指して',
                        balloons: [
                            '何から勉強していいのかわからない',
                            '新しい技術を習得したい',
                            '現場の疑問や不安を共有したい',
                            '自分に合った勉強会がない'
                        ],
                        heading: '社内スタッフの技術向上で、あらゆるニーズに対応',
                        texts: [
                            '現場の業務ニーズに合わせた柔軟なカリキュラム構成で社内勉強会を開催します。高い技術力、提案力で柔軟な対応が可能です。',
                            '業界全体の技術力向上に欠かせないコミュニティ文化を大切にしたい、chatbox はそんな思いでコミュニティイベントの運営・支援を行っております。',
                            'イベント運営を元に身につけた技術力は、技術顧問やWeb制作の業務分野で大きく役立っています。',
                            '現場の業務ニーズに合わせた柔軟なカリキュラム構成で社内勉強会を開催や各種企業の求人・広報活動の一環としての、会場提供・スポンサーのご相談もお伺いしております。',
                            '「スクール運営」では、一般的な学校やスクールでは学びづらい、「イマドキの現場で役立つ生の技術」をテーマに様々なカリキュラムを構築し、',
                            '学生や現場で働く技術者・デザイナーなど、多数の参加者に恵まれながら「現場で使える最新技術」の普及を行っています。',
                        ],
                        number: 'num04',
                        thumbnail: '/images/serviceHeading_event.jpg',
                        id: 'event',
                        examples: [
                            'イベント運営・支援',
                            'スクール運営',
                        ]
                    }
                ]
            }
        },
        components: {
            ServiceSection
        }
    }
</script>

<style lang="scss" scoped>
  @import "~assets/scss/layout/_layout.scss";
  @import "~assets/scss/object/component/_container.scss";

</style>

